UT_Marketplaces.Marketplaces/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/CommonModules/РаботаСШтрихкодами/Module.bsl
Функция ПолучитьДокументПоШК(Штрихкод) Экспорт
	//Менеджеры = Новый Массив();
	//СтрокаДляПредопределенногоЗначеня = "Документ." + ИмяДокумента + ".ПустаяСсылка";
	//Менеджеры.Добавить(ПредопределенноеЗначение(СтрокаДляПредопределенногоЗначеня));
	//Результат = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	Результат = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод);
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0]; 
	КонецЕсли;
КонецФункции

Функция ПолучитьНоменклатуруПоШК(Штрихкод) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ВидыНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО ШтрихкодыНоменклатуры.Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		СтруктураОтвета=Новый Структура("НоменклатураСДанными,Характеристика,Упаковка,Штрихкод,ИспользоватьСерии",РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(РезультатЗапроса[0].Номенклатура),
								РезультатЗапроса[0].Характеристика,
								РезультатЗапроса[0].Упаковка,Штрихкод,РезультатЗапроса[0].ИспользоватьСерии);
		
		Возврат СтруктураОтвета;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДанныеТовараПоШК(Штрихкод) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ДанныеШтрихкода=Новый Структура("Номенклатура,НоменклатураСДанными,Характеристика,Упаковка",Выборка.Номенклатура,РаботаСоСправочниками.ПолучитьВсеСопутсвующиеДанныеПоНоменклатуре(Выборка.Номенклатура),
								Выборка.Характеристика,
								Выборка.Упаковка);	
		Возврат ДанныеШтрихкода;
	КонецЕсли;
		
КонецФункции

Функция ПосчитатьКоэффициентУпаковки(Упаковка, ЕдИзм) Экспорт
	
	Если Упаковка = ЕдИзм Тогда 
		Возврат 1;
	КонецЕсли;
	Если Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Конечная Тогда 
		Возврат Упаковка.Числитель;
	ИначеЕсли Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда
		Коэффициент = Упаковка.КоличествоУпаковок;
		Родитель = Упаковка.Родитель;
		Если НЕ ЗначениеЗаполнено(Родитель) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Пока ЗначениеЗаполнено(Родитель) Цикл 
			Если Родитель.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Составная Тогда 
				Коэффициент = Коэффициент*Родитель.КоличествоУпаковок;
				Родитель = Родитель.Родитель;
			Иначе 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Коэффициент = Коэффициент*ПосчитатьКоэффициентУпаковки(Родитель, ЕдИзм);
		Возврат Коэффициент;		
	ИначеЕсли Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.Разупаковка Тогда
		Если Упаковка.Знаменатель = 0 Тогда 
			Возврат Неопределено;
		Иначе 
			Коэффициент = (1/Упаковка.Знаменатель);
			Возврат Коэффициент;
		КонецЕсли;
	ИначеЕсли Упаковка.ТипУпаковки = Перечисления.ТипыУпаковокНоменклатуры.ТоварноеМесто Тогда
		Если ЗначениеЗаполнено(Упаковка.КоличествоУпаковок) Тогда 
			Коэффициент = (1/Упаковка.КоличествоУпаковок);
			Возврат Коэффициент;	
		Иначе 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
КонецФункции // ПосчитатьКоэффициентУпаковки()

Функция ПолучитьШК(Ссылка) Экспорт
	Возврат ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Ссылка);		
КонецФункции

Функция ПолучитьСсылкуЯчейкиПоШК(Штрихкод) Экспорт
	
	МассивМенеджеров = Новый Массив;
	МассивМенеджеров.Добавить(Справочники.СкладскиеЯчейки.ПустаяСсылка());
	
	ЯчейкаСсылка = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, МассивМенеджеров);	
	
	Если ЯчейкаСсылка.Количество() > 0 Тогда 
		Возврат ЯчейкаСсылка[0];
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
